NordicSemiconductor/nrfx/mdk/nrf54h20_engb_global.h
/*

Copyright (c) 2010 - 2024, Nordic Semiconductor ASA All rights reserved.

SPDX-License-Identifier: BSD-3-Clause

Redistribution and use in source and binary forms, with or without
modification, are permitted provided that the following conditions are met:

1. Redistributions of source code must retain the above copyright notice, this
   list of conditions and the following disclaimer.

2. Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the
   documentation and/or other materials provided with the distribution.

3. Neither the name of Nordic Semiconductor ASA nor the names of its
   contributors may be used to endorse or promote products derived from this
   software without specific prior written permission.

THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
IMPLIED WARRANTIES OF MERCHANTABILITY, AND FITNESS FOR A PARTICULAR PURPOSE
ARE DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
POSSIBILITY OF SUCH DAMAGE.

*/

#ifndef NRF54H20_ENGB_GLOBAL_H
#define NRF54H20_ENGB_GLOBAL_H

#ifdef __cplusplus
    extern "C" {
#endif


/* ========================================= Start of section using anonymous unions ========================================= */

#include "compiler_abstraction.h"

#if defined (__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined (__ICCARM__)
  #pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wc11-extensions"
  #pragma clang diagnostic ignored "-Wreserved-id-macro"
  #pragma clang diagnostic ignored "-Wgnu-anonymous-struct"
  #pragma clang diagnostic ignored "-Wnested-anon-types"
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning 586
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Unsupported compiler type
#endif

/* =========================================================================================================================== */
/* ================                                  Peripheral Address Map                                  ================ */
/* =========================================================================================================================== */

#define NRF_FICR_NS_BASE                  0x0FFFE000UL
#define NRF_USBHSCORE0_NS_BASE            0x2F700000UL
#define NRF_USBHSCORE0_S_BASE             0x2F700000UL
#define NRF_I3CCORE120_NS_BASE            0x2FBE0000UL
#define NRF_I3CCORE121_NS_BASE            0x2FBE1000UL
#define NRF_DMU120_NS_BASE                0x2FBEF800UL
#define NRF_MCAN120_NS_BASE               0x2FBEF800UL
#define NRF_STMDATA_NS_BASE               0xA0000000UL
#define NRF_STMDATA_S_BASE                0xA0000000UL
#define NRF_TDDCONF_NS_BASE               0xBF001000UL
#define NRF_TDDCONF_S_BASE                0xBF001000UL
#define NRF_STM_NS_BASE                   0xBF042000UL
#define NRF_TPIU_NS_BASE                  0xBF043000UL
#define NRF_ETB_NS_BASE                   0xBF044000UL
#define NRF_CTI210_NS_BASE                0xBF046000UL
#define NRF_CTI211_NS_BASE                0xBF047000UL
#define NRF_ATBREPLICATOR210_NS_BASE      0xBF048000UL
#define NRF_ATBREPLICATOR211_NS_BASE      0xBF049000UL
#define NRF_ATBREPLICATOR212_NS_BASE      0xBF04A000UL
#define NRF_ATBREPLICATOR213_NS_BASE      0xBF04B000UL
#define NRF_ATBFUNNEL210_NS_BASE          0xBF04C000UL
#define NRF_ATBFUNNEL211_NS_BASE          0xBF04D000UL
#define NRF_ATBFUNNEL212_NS_BASE          0xBF04E000UL
#define NRF_ATBFUNNEL213_NS_BASE          0xBF04F000UL
#define NRF_GPR_NS_BASE                   0xBF050000UL
#define NRF_GPIOTE130_NS_BASE             0x4F934000UL
#define NRF_GPIOTE130_S_BASE              0x5F934000UL
#define NRF_GRTC_NS_BASE                  0x4F99C000UL
#define NRF_GRTC_S_BASE                   0x5F99C000UL
#define NRF_TBM_NS_BASE                   0xBF003000UL
#define NRF_TBM_S_BASE                    0xBF003000UL
#define NRF_USBHS_NS_BASE                 0x4F086000UL
#define NRF_USBHS_S_BASE                  0x5F086000UL
#define NRF_EXMIF_NS_BASE                 0x4F095000UL
#define NRF_EXMIF_S_BASE                  0x5F095000UL
#define NRF_SECDOMBELLBOARD_NS_BASE       0x4F099000UL
#define NRF_SECDOMBELLBOARD_S_BASE        0x5F099000UL
#define NRF_CANPLL_NS_BASE                0x4F8C2000UL
#define NRF_CANPLL_S_BASE                 0x5F8C2000UL
#define NRF_VPR120_NS_BASE                0x4F8C8000UL
#define NRF_VPR120_S_BASE                 0x5F8C8000UL
#define NRF_IPCT120_NS_BASE               0x4F8D1000UL
#define NRF_IPCT120_S_BASE                0x5F8D1000UL
#define NRF_MUTEX120_NS_BASE              0x4F8D2000UL
#define NRF_I3C120_NS_BASE                0x4F8D3000UL
#define NRF_I3C120_S_BASE                 0x5F8D3000UL
#define NRF_VPR121_NS_BASE                0x4F8D4000UL
#define NRF_VPR121_S_BASE                 0x5F8D4000UL
#define NRF_CAN120_NS_BASE                0x4F8D8000UL
#define NRF_CAN120_S_BASE                 0x5F8D8000UL
#define NRF_MVDMA120_NS_BASE              0x4F8D9000UL
#define NRF_MVDMA120_S_BASE               0x5F8D9000UL
#define NRF_RAMC122_NS_BASE               0x4F8DA000UL
#define NRF_RAMC122_S_BASE                0x5F8DA000UL
#define NRF_I3C121_NS_BASE                0x4F8DE000UL
#define NRF_I3C121_S_BASE                 0x5F8DE000UL
#define NRF_DPPIC120_NS_BASE              0x4F8E1000UL
#define NRF_DPPIC120_S_BASE               0x5F8E1000UL
#define NRF_TIMER120_NS_BASE              0x4F8E2000UL
#define NRF_TIMER120_S_BASE               0x5F8E2000UL
#define NRF_TIMER121_NS_BASE              0x4F8E3000UL
#define NRF_TIMER121_S_BASE               0x5F8E3000UL
#define NRF_PWM120_NS_BASE                0x4F8E4000UL
#define NRF_PWM120_S_BASE                 0x5F8E4000UL
#define NRF_SPIS120_NS_BASE               0x4F8E5000UL
#define NRF_SPIS120_S_BASE                0x5F8E5000UL
#define NRF_SPIM120_NS_BASE               0x4F8E6000UL
#define NRF_UARTE120_NS_BASE              0x4F8E6000UL
#define NRF_SPIM120_S_BASE                0x5F8E6000UL
#define NRF_UARTE120_S_BASE               0x5F8E6000UL
#define NRF_SPIM121_NS_BASE               0x4F8E7000UL
#define NRF_SPIM121_S_BASE                0x5F8E7000UL
#define NRF_VPR130_NS_BASE                0x4F908000UL
#define NRF_VPR130_S_BASE                 0x5F908000UL
#define NRF_IPCT130_NS_BASE               0x4F921000UL
#define NRF_IPCT130_S_BASE                0x5F921000UL
#define NRF_DPPIC130_NS_BASE              0x4F922000UL
#define NRF_DPPIC130_S_BASE               0x5F922000UL
#define NRF_MUTEX130_NS_BASE              0x4F927000UL
#define NRF_RTC130_NS_BASE                0x4F928000UL
#define NRF_RTC130_S_BASE                 0x5F928000UL
#define NRF_RTC131_NS_BASE                0x4F929000UL
#define NRF_RTC131_S_BASE                 0x5F929000UL
#define NRF_WDT131_NS_BASE                0x4F92B000UL
#define NRF_WDT131_S_BASE                 0x5F92B000UL
#define NRF_WDT132_NS_BASE                0x4F92C000UL
#define NRF_WDT132_S_BASE                 0x5F92C000UL
#define NRF_EGU130_NS_BASE                0x4F92D000UL
#define NRF_EGU130_S_BASE                 0x5F92D000UL
#define NRF_P0_NS_BASE                    0x4F938000UL
#define NRF_P1_NS_BASE                    0x4F938200UL
#define NRF_P2_NS_BASE                    0x4F938400UL
#define NRF_P6_NS_BASE                    0x4F938C00UL
#define NRF_P7_NS_BASE                    0x4F938E00UL
#define NRF_P0_S_BASE                     0x5F938000UL
#define NRF_P1_S_BASE                     0x5F938200UL
#define NRF_P2_S_BASE                     0x5F938400UL
#define NRF_P6_S_BASE                     0x5F938C00UL
#define NRF_P7_S_BASE                     0x5F938E00UL
#define NRF_P9_NS_BASE                    0x4F939200UL
#define NRF_P9_S_BASE                     0x5F939200UL
#define NRF_DPPIC131_NS_BASE              0x4F981000UL
#define NRF_DPPIC131_S_BASE               0x5F981000UL
#define NRF_SAADC_NS_BASE                 0x4F982000UL
#define NRF_SAADC_S_BASE                  0x5F982000UL
#define NRF_COMP_NS_BASE                  0x4F983000UL
#define NRF_LPCOMP_NS_BASE                0x4F983000UL
#define NRF_COMP_S_BASE                   0x5F983000UL
#define NRF_LPCOMP_S_BASE                 0x5F983000UL
#define NRF_TEMP_NS_BASE                  0x4F984000UL
#define NRF_TEMP_S_BASE                   0x5F984000UL
#define NRF_NFCT_NS_BASE                  0x4F985000UL
#define NRF_NFCT_S_BASE                   0x5F985000UL
#define NRF_DPPIC132_NS_BASE              0x4F991000UL
#define NRF_DPPIC132_S_BASE               0x5F991000UL
#define NRF_TDM130_NS_BASE                0x4F992000UL
#define NRF_TDM130_S_BASE                 0x5F992000UL
#define NRF_PDM_NS_BASE                   0x4F993000UL
#define NRF_PDM_S_BASE                    0x5F993000UL
#define NRF_QDEC130_NS_BASE               0x4F994000UL
#define NRF_QDEC130_S_BASE                0x5F994000UL
#define NRF_QDEC131_NS_BASE               0x4F995000UL
#define NRF_QDEC131_S_BASE                0x5F995000UL
#define NRF_TDM131_NS_BASE                0x4F997000UL
#define NRF_TDM131_S_BASE                 0x5F997000UL
#define NRF_DPPIC133_NS_BASE              0x4F9A1000UL
#define NRF_DPPIC133_S_BASE               0x5F9A1000UL
#define NRF_TIMER130_NS_BASE              0x4F9A2000UL
#define NRF_TIMER130_S_BASE               0x5F9A2000UL
#define NRF_TIMER131_NS_BASE              0x4F9A3000UL
#define NRF_TIMER131_S_BASE               0x5F9A3000UL
#define NRF_PWM130_NS_BASE                0x4F9A4000UL
#define NRF_PWM130_S_BASE                 0x5F9A4000UL
#define NRF_SPIM130_NS_BASE               0x4F9A5000UL
#define NRF_SPIS130_NS_BASE               0x4F9A5000UL
#define NRF_TWIM130_NS_BASE               0x4F9A5000UL
#define NRF_TWIS130_NS_BASE               0x4F9A5000UL
#define NRF_UARTE130_NS_BASE              0x4F9A5000UL
#define NRF_SPIM130_S_BASE                0x5F9A5000UL
#define NRF_SPIS130_S_BASE                0x5F9A5000UL
#define NRF_TWIM130_S_BASE                0x5F9A5000UL
#define NRF_TWIS130_S_BASE                0x5F9A5000UL
#define NRF_UARTE130_S_BASE               0x5F9A5000UL
#define NRF_SPIM131_NS_BASE               0x4F9A6000UL
#define NRF_SPIS131_NS_BASE               0x4F9A6000UL
#define NRF_TWIM131_NS_BASE               0x4F9A6000UL
#define NRF_TWIS131_NS_BASE               0x4F9A6000UL
#define NRF_UARTE131_NS_BASE              0x4F9A6000UL
#define NRF_SPIM131_S_BASE                0x5F9A6000UL
#define NRF_SPIS131_S_BASE                0x5F9A6000UL
#define NRF_TWIM131_S_BASE                0x5F9A6000UL
#define NRF_TWIS131_S_BASE                0x5F9A6000UL
#define NRF_UARTE131_S_BASE               0x5F9A6000UL
#define NRF_DPPIC134_NS_BASE              0x4F9B1000UL
#define NRF_DPPIC134_S_BASE               0x5F9B1000UL
#define NRF_TIMER132_NS_BASE              0x4F9B2000UL
#define NRF_TIMER132_S_BASE               0x5F9B2000UL
#define NRF_TIMER133_NS_BASE              0x4F9B3000UL
#define NRF_TIMER133_S_BASE               0x5F9B3000UL
#define NRF_PWM131_NS_BASE                0x4F9B4000UL
#define NRF_PWM131_S_BASE                 0x5F9B4000UL
#define NRF_SPIM132_NS_BASE               0x4F9B5000UL
#define NRF_SPIS132_NS_BASE               0x4F9B5000UL
#define NRF_TWIM132_NS_BASE               0x4F9B5000UL
#define NRF_TWIS132_NS_BASE               0x4F9B5000UL
#define NRF_UARTE132_NS_BASE              0x4F9B5000UL
#define NRF_SPIM132_S_BASE                0x5F9B5000UL
#define NRF_SPIS132_S_BASE                0x5F9B5000UL
#define NRF_TWIM132_S_BASE                0x5F9B5000UL
#define NRF_TWIS132_S_BASE                0x5F9B5000UL
#define NRF_UARTE132_S_BASE               0x5F9B5000UL
#define NRF_SPIM133_NS_BASE               0x4F9B6000UL
#define NRF_SPIS133_NS_BASE               0x4F9B6000UL
#define NRF_TWIM133_NS_BASE               0x4F9B6000UL
#define NRF_TWIS133_NS_BASE               0x4F9B6000UL
#define NRF_UARTE133_NS_BASE              0x4F9B6000UL
#define NRF_SPIM133_S_BASE                0x5F9B6000UL
#define NRF_SPIS133_S_BASE                0x5F9B6000UL
#define NRF_TWIM133_S_BASE                0x5F9B6000UL
#define NRF_TWIS133_S_BASE                0x5F9B6000UL
#define NRF_UARTE133_S_BASE               0x5F9B6000UL
#define NRF_DPPIC135_NS_BASE              0x4F9C1000UL
#define NRF_DPPIC135_S_BASE               0x5F9C1000UL
#define NRF_TIMER134_NS_BASE              0x4F9C2000UL
#define NRF_TIMER134_S_BASE               0x5F9C2000UL
#define NRF_TIMER135_NS_BASE              0x4F9C3000UL
#define NRF_TIMER135_S_BASE               0x5F9C3000UL
#define NRF_PWM132_NS_BASE                0x4F9C4000UL
#define NRF_PWM132_S_BASE                 0x5F9C4000UL
#define NRF_SPIM134_NS_BASE               0x4F9C5000UL
#define NRF_SPIS134_NS_BASE               0x4F9C5000UL
#define NRF_TWIM134_NS_BASE               0x4F9C5000UL
#define NRF_TWIS134_NS_BASE               0x4F9C5000UL
#define NRF_UARTE134_NS_BASE              0x4F9C5000UL
#define NRF_SPIM134_S_BASE                0x5F9C5000UL
#define NRF_SPIS134_S_BASE                0x5F9C5000UL
#define NRF_TWIM134_S_BASE                0x5F9C5000UL
#define NRF_TWIS134_S_BASE                0x5F9C5000UL
#define NRF_UARTE134_S_BASE               0x5F9C5000UL
#define NRF_SPIM135_NS_BASE               0x4F9C6000UL
#define NRF_SPIS135_NS_BASE               0x4F9C6000UL
#define NRF_TWIM135_NS_BASE               0x4F9C6000UL
#define NRF_TWIS135_NS_BASE               0x4F9C6000UL
#define NRF_UARTE135_NS_BASE              0x4F9C6000UL
#define NRF_SPIM135_S_BASE                0x5F9C6000UL
#define NRF_SPIS135_S_BASE                0x5F9C6000UL
#define NRF_TWIM135_S_BASE                0x5F9C6000UL
#define NRF_TWIS135_S_BASE                0x5F9C6000UL
#define NRF_UARTE135_S_BASE               0x5F9C6000UL
#define NRF_DPPIC136_NS_BASE              0x4F9D1000UL
#define NRF_DPPIC136_S_BASE               0x5F9D1000UL
#define NRF_TIMER136_NS_BASE              0x4F9D2000UL
#define NRF_TIMER136_S_BASE               0x5F9D2000UL
#define NRF_TIMER137_NS_BASE              0x4F9D3000UL
#define NRF_TIMER137_S_BASE               0x5F9D3000UL
#define NRF_PWM133_NS_BASE                0x4F9D4000UL
#define NRF_PWM133_S_BASE                 0x5F9D4000UL
#define NRF_SPIM136_NS_BASE               0x4F9D5000UL
#define NRF_SPIS136_NS_BASE               0x4F9D5000UL
#define NRF_TWIM136_NS_BASE               0x4F9D5000UL
#define NRF_TWIS136_NS_BASE               0x4F9D5000UL
#define NRF_UARTE136_NS_BASE              0x4F9D5000UL
#define NRF_SPIM136_S_BASE                0x5F9D5000UL
#define NRF_SPIS136_S_BASE                0x5F9D5000UL
#define NRF_TWIM136_S_BASE                0x5F9D5000UL
#define NRF_TWIS136_S_BASE                0x5F9D5000UL
#define NRF_UARTE136_S_BASE               0x5F9D5000UL
#define NRF_SPIM137_NS_BASE               0x4F9D6000UL
#define NRF_SPIS137_NS_BASE               0x4F9D6000UL
#define NRF_TWIM137_NS_BASE               0x4F9D6000UL
#define NRF_TWIS137_NS_BASE               0x4F9D6000UL
#define NRF_UARTE137_NS_BASE              0x4F9D6000UL
#define NRF_SPIM137_S_BASE                0x5F9D6000UL
#define NRF_SPIS137_S_BASE                0x5F9D6000UL
#define NRF_TWIM137_S_BASE                0x5F9D6000UL
#define NRF_TWIS137_S_BASE                0x5F9D6000UL
#define NRF_UARTE137_S_BASE               0x5F9D6000UL

/* =========================================================================================================================== */
/* ================                                  Peripheral Declaration                                  ================ */
/* =========================================================================================================================== */

